mikkelfb/P4_Vertical_farm/RTOS_TEMPLATE-master/PlanteModul.cydsn/Generated_Source/PSoC5/DS18x8_1_StatusReg_BUS.h
/*******************************************************************************
* File Name: DS18x8_1_StatusReg_BUS.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_DS18x8_1_StatusReg_BUS_H) /* CY_STATUS_REG_DS18x8_1_StatusReg_BUS_H */
#define CY_STATUS_REG_DS18x8_1_StatusReg_BUS_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} DS18x8_1_StatusReg_BUS_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 DS18x8_1_StatusReg_BUS_Read(void) ;
void DS18x8_1_StatusReg_BUS_InterruptEnable(void) ;
void DS18x8_1_StatusReg_BUS_InterruptDisable(void) ;
void DS18x8_1_StatusReg_BUS_WriteMask(uint8 mask) ;
uint8 DS18x8_1_StatusReg_BUS_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define DS18x8_1_StatusReg_BUS_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define DS18x8_1_StatusReg_BUS_INPUTS              8


/***************************************
*             Registers
***************************************/

/* Status Register */
#define DS18x8_1_StatusReg_BUS_Status             (* (reg8 *) DS18x8_1_StatusReg_BUS_sts_sts_reg__STATUS_REG )
#define DS18x8_1_StatusReg_BUS_Status_PTR         (  (reg8 *) DS18x8_1_StatusReg_BUS_sts_sts_reg__STATUS_REG )
#define DS18x8_1_StatusReg_BUS_Status_Mask        (* (reg8 *) DS18x8_1_StatusReg_BUS_sts_sts_reg__MASK_REG )
#define DS18x8_1_StatusReg_BUS_Status_Aux_Ctrl    (* (reg8 *) DS18x8_1_StatusReg_BUS_sts_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_DS18x8_1_StatusReg_BUS_H */


/* [] END OF FILE */
